package com.android.kiosk

class KioskMain {

//    [ 필요한 기능 ]
//    요구사항1: 메인 메뉴판 화면  -> println으로 간단하게 출력
//    : 메뉴 선택시 상세 메뉴화면으로 이동 -> 번호 선택시 상세페이지 이동(계산기때 했던것처럼) 메뉴별 클래스, 상세정보 출력 메소드 오버라이드
//    : 잘못된 번호 선택 시 예외처리 -> try..catch문 이용
//    : 프로그램 종료을 위한 번호 정의 -> [0] 키오스크 종료하기
//
//    요구사항2: 현재 잔액과 가격을 비교해서 구매 가능한 상태를 클래스에 추가적으로 구현합니다 -> 잔액값 입력받아 가격값이랑 비교       //////////까지 구현 예정

//    요구사항3: 특정 작업이 종료된 후, 3초 뒤에 다른 작업을 수행할 수 있도록 코드를 작성합니다.
//    요구사항4: 결제할 때 현재 시간을 비교하여 특정 시간대에는 결제할 수 없다는
//              알림 메시지를 콘솔창에 출력해줍니다.
//    요구사항5: 결제가 완료 되었다면 시간을 띄워줍니다.(출력 예시 참고)
//    요구사항6: 프로그램을 종료할 때까지 5초마다 현재 주문 대기수를 실시간으로 출력해줍니다.
}